; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph4 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	infrared0 - mode
	infrared1 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument5 spectrograph3)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph3)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
)
(:goal (and
	(have_image Star5 spectrograph2)
	(have_image Star6 spectrograph3)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 spectrograph2)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
	(have_image Star11 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation0 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite1 planet9 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet9)
   goals met: 0 of 7
5. (take_image satellite1 planet9 instrument2 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 7
8. (take_image satellite1 phenomenon7 instrument2 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 2 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
10. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 2 of 7
11. (turn_to satellite0 star5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star5)
   goals met: 2 of 7
12. (take_image satellite0 star5 instrument0 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 3 of 7
13. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 3 of 7
14. (take_image satellite0 star6 instrument0 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 4 of 7
15. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 4 of 7
16. (take_image satellite0 star8 instrument0 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 5 of 7
17. (turn_to satellite1 star10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star10)
   goals met: 5 of 7
18. (take_image satellite1 star10 instrument2 infrared0)
   added: (have_image star10 infrared0)
   goals met: 6 of 7
19. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 6 of 7
20. (take_image satellite1 star11 instrument2 infrared1)
   added: (have_image star11 infrared1)
   goals met: 7 of 7
